sterentev/atdf-device-asm-include/inc/ATmega32HVB.inc
; ----------	Register VADCSR bits		------------------------
.equ	VADEN		= 3		; 0x08 - VADC Enable
.equ	VADSC		= 2		; 0x04 - VADC Satrt Conversion
.equ	VADCCIF		= 1		; 0x02 - VADC Conversion Complete Interrupt Flag
.equ	VADCCIE		= 0		; 0x01 - VADC Conversion Complete Interrupt Enable



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	FET MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register FCSR bits		------------------------
.equ	DUVRD		= 3		; 0x08 - Deep Under-Voltage Recovery Disable
.equ	CPS		= 2		; 0x04 - Current Protection Status
.equ	DFE		= 1		; 0x02 - Discharge FET Enable
.equ	CFE		= 0		; 0x01 - Charge FET Enable



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPDR bits		------------------------
.equ	SPDR_MASK	= 0xFF		;      - SPI Data bits (8 bits)
.equ	SPDR0		= 0		;          SPDR BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EEAR bits		------------------------
.equ	EEAR_MASK	= 0x03FF	;      - EEPROM Address bits (10 bits)
.equ	EEAR0		= 0		;          EEAR BIT0 position

; ----------	Register EEDR bits		------------------------
.equ	EEDR_MASK	= 0xFF		;      - EEPROM Data bits (8 bits)
.equ	EEDR0		= 0		;          EEDR BIT0 position

; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      -  (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEProm Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only



; ====	COULOMB_COUNTER MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register CADCSRA bits		------------------------
.equ	CADEN		= 7		; 0x80 - When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled.
.equ	CADPOL		= 6		; 0x40 - 
.equ	CADUB		= 5		; 0x20 - CC_ADC Update Busy
.equ	CADAS_MASK	= 0x18		;      - CC_ADC Accumulate Current Select Bits (2 bits)
.equ	CADAS0		= 3		;          CADAS BIT0 position
.equ	CADSI_MASK	= 0x06		;      - The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. (2 bits)
.equ	CADSI0		= 1		;          CADSI BIT0 position
.equ	CADSE		= 0		; 0x01 - When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode.

; ----------	Register CADCSRB bits		------------------------
.equ	CADACIE		= 6		; 0x40 - 
.equ	CADRCIE		= 5		; 0x20 - Regular Current Interrupt Enable
.equ	CADICIE		= 4		; 0x10 - CAD Instantaneous Current Interrupt Enable
.equ	CADACIF		= 2		; 0x04 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADRCIF		= 1		; 0x02 - CC-ADC Accumulate Current Interrupt Flag
.equ	CADICIF		= 0		; 0x01 - CC-ADC Instantaneous Current Interrupt Flag

; ----------	Register CADCSRC bits		------------------------
.equ	CADVSE		= 0		; 0x01 - CC-ADC Voltage Scaling Enable

; ----------	Register CADIC bits		------------------------
.equ	CADIC_MASK	= 0xFFFF	;      - CC-ADC Instantaneous Current (16 bits)
.equ	CADIC0		= 0		;          CADIC BIT0 position

; ----------	Register CADAC3 bits		------------------------
.equ	CADAC3_CADAC_MASK= 0xFF		;      - ADC accumulate current bits (8 bits)
.equ	CADAC3_CADAC0	= 0		;          CADAC3_CADAC BIT0 position

; ----------	Register CADAC2 bits		------------------------
.equ	CADAC2_CADAC_MASK= 0xFF		;      - ADC accumulate current bits (8 bits)
.equ	CADAC2_CADAC0	= 0		;          CADAC2_CADAC BIT0 position

; ----------	Register CADAC1 bits		------------------------
.equ	CADAC1_CADAC_MASK= 0xFC		;      - ADC accumulate current bits (6 bits)
.equ	CADAC1_CADAC0	= 2		;          CADAC1_CADAC BIT0 position
.equ	CADAC1_CADAC0_MASK= 0x03		;      - ADC accumulate current bits (2 bits)
.equ	CADAC1_CADAC00	= 0		;          CADAC1_CADAC0 BIT0 position

; ----------	Register CADAC0 bits		------------------------
.equ	CADAC0_CADAC0_MASK= 0xFF		;      - ADC accumulate current bits (8 bits)
.equ	CADAC0_CADAC00	= 0		;          CADAC0_CADAC0 BIT0 position

; ----------	Register CADRCC bits		------------------------
.equ	CADRCC_MASK	= 0xFF		;      - CC-ADC Regular Charge Current (8 bits)
.equ	CADRCC0		= 0		;          CADRCC BIT0 position

